<template>
  <div class="about">
    <div class="logo">logo</div>
    <h1>首部及导言</h1>
    <p>欢迎您使用超星俱乐部软件及服务！</p>
    <p>
      超星俱乐部由中顺公司负责开发及运营。为使用超星俱乐部，您应当阅读并遵守《超星俱乐部许可及服务协议》。请您务必审慎阅读、充分理解条款内容，并选择接受或不接受。
    </p>
    <h1>一、关于超星俱乐部</h1>
    <p>
      超星俱乐部由中顺公司负责开发及运营。为使用超星俱乐部，您应当阅读并遵守《超星俱乐部许可及服务协议》。请您务必审慎阅读、充分理解条款内容，并选择接受或不接受。超星俱乐部由中顺公司负责开发及运营。为使用超星俱乐部，您应当阅读并遵守《超星俱乐部许可及服务协议》。请您务必审慎阅读、充分理解条款内容，并选择接受或不接受。超星俱乐部由中顺公司负责开发及运营。为使用超星俱乐部，您应当阅读并遵守《超星俱乐部许可及服务协议》。请您务必审慎阅读、充分理解条款内容，并选择接受或不接受。超星俱乐部由中顺公司负责开发及运营。为使用超星俱乐部，您应当阅读并遵守《超星俱乐部许可及服务协议》。请您务必审慎阅读、充分理解条款内容，并选择接受或不接受。超星俱乐部由中顺公司负责开发及运营。为使用超星俱乐部，您应当阅读并遵守《超星俱乐部许可及服务协议》。请您务必审慎阅读、充分理解条款内容，并选择接受或不接受。超星俱乐部由中顺公司负责开发及运营。
    </p>
  </div>
</template>
<style lang="less" scoped>
.about {
  padding: 0 32px 64px;
  background-color: @bg-second;
  overflow: hidden;
  min-height: 100vh;
  .logo {
    margin: 64px auto;
    text-align: center;
  }
  h1 {
    font-size: 36px;
    margin: 32px 0 16px;
  }
  p {
    letter-spacing: 0;
    text-align: justify;
    line-height: 40px;
    margin: 8px 0;
  }
}
</style>
