export const statusMap = {
  0: "去完成",
  1: "领取",
  2: "已领取",
};
//
export const TASK_MAP = {
  每日签到: "11000", // "每日签到", 触发任务说明 写数字的话不明白 啥意思.
};
export default {
  10001: "去完成", //"参与积分夺宝",
  10002: "去完成", //"完成一次积分商城兑换",
  10003: "去完成", //"下载任意一款游戏",
  10100: "去完成", //"完善个人资料",
  10200: "未完成", // "会员等级达到V1",
  10201: "未完成", // "会员等级达到V2",
  10202: "未完成", // "会员等级达到V3",
  10203: "未完成", // "会员等级达到V4",
  10204: "未完成", // "会员等级达到V5",
  11000: "未完成", // "每日签到",
  11001: "未完成", // "今日首充",
  11002: "未完成", // "登录任意一款游戏",
  11003: "去完成", // "领取一次游戏福利礼包",
};
