/* eslint-disable */ 
export const powerMap = {
    "会员商城": { value: "可以在积分商城通过积分兑换各种实物周边或游戏道具。", vips: '【V0-白星会员】及以上专享。' },
    "特权礼包": { value: "每位用户每个档位的VIP等级可领取一次特权礼包。", vips: '【V1-铜星会员】及以上专享' },
    "月礼包": { value: "玩家每个自然月可到【福利】界面领取专属的会员礼包福利，每月限一次。", vips: '【V1-铜星会员】及以上专享' },
    "抢先试玩": { value: "新游发布前，享有抢先体验特权。", vips: '【V2-银星会员】及以上专享' },
    "新游礼包": { value: "新游专属礼包：新游上线时，可领取独享新游礼包", vips: '【V2-银星会员】及以上专享' },
    "周礼包": { value: "每个自然周可到【福利】界面领取专属的会员礼包福利，每周限一次。", vips: '【V3-铜星会员】及以上专享' },
    "专属道具": { value: "专属道具：及以上专享，可通过积分商城或其他途径获取游戏内的专属道具。", vips: '【V3-金星会员】及以上专享' },
    "生日祝福": { value: "玩家在生日当天可收到由星仔及专属客服提供的专属生日祝福。", vips: '【V4-钻星会员】及以上专享' },
    "生日礼包": { value: "玩家在生日当天可收到用星仔提供的专属生日礼包，V5-超星会员用户享有额外神秘生日礼物。", vips: '【V4-钻星会员】及以上专享' },
    "充值返利": { value: "添加专属客服后，客服将联系您推送单日充值返利的标准及规则。", vips: '【V3-金星会员】及以上专享' },
    "1V1客服": { value: "尊享1V1客服服务，相应更及时，处理更迅速！", vips: '【V3-金星会员】及以上专享' },
    "专属见面礼": { value: "添加专属客服后，将为您送上诚挚见面礼，每位用户限一次。", vips: '【V3-金星会员】及以上专享' },
    "日礼包": { value: "每个自然日可到【福利】界面领取专属的会员礼包福利，每日限一次。", vips: '【V4-钻星会员】及以上专享' },
    "修复优先": { value: "玩家若在游戏内误操作导致损失，可进行补回，VIP每6个月内限1次（单个道具）、VIP5每3个月限1次（单个道具）。目前支持游戏：《火柴人觉醒》、《鸿图归来》。", vips: '【V4-钻星会员】及以上专享' },
    "申诉优先": { value: "账号被盗取后，可联系专属客服进行人工快速找回。目前支持游戏：《火柴人觉醒》,《弓箭大冒险》。", vips: '【V4-钻星会员】及以上专享' },
}
export default {
    0: {
        name: "白银会员", value: 1, power: ['会员商城']
    },
    1: {
        name: "铜星会员", value: 2000, power: `特权礼包,月礼包,会员商城`.split(',')
    },
    2: {
        name: "银星会员", value: 10000, power: '特权礼包,月礼包,新游礼包,会员商城,抢先试玩'.split(",")
    },
    3: {
        name: "金星会员", value: 60000, power: '特权礼包,周礼包,月礼包,新游礼包,专属道具,充值返利,1V1客服,专属见面礼,会员商城,抢先试玩'.split(",")
    },
    4: {
        name: "钻星会员", value: 300000, power: '特权礼包,日礼包,周礼包,月礼包,新游礼包,充值返利,1V1客服,专属见面礼,会员商城,抢先试玩,修复优先,申诉优先'.split(",")
    },
    5: {
        name: "超星会员", value: 3000000, power: '特权礼包,日礼包,周礼包,月礼包,新游礼包,专属道具,生日祝福,生日礼包,充值返利,1V1客服,专属见面礼,会员商城,抢先试玩,修复优先,申诉优先'.split(",")
    },
}